#include "init.h"
#include "scheduler.h"
 
/**
 *	-2019/11/17
 *	@note
 *	1. 摄像头的位置固定需要稳定，用大弹暴力测试
 *	2. 云台归中的意义是为了偏移的时候能够回来，保证能够看到大符
 *	3. 陀螺仪数据反馈会漂移，可以试一下换主控板（这个问题是陀螺仪初始化得到问题，已解决）
 *	4. 注意关大符，关电，关遥控等等细节问题
 *	5. 中二、热血，深大总冠军！
 *	6. 组长监督组员，分配好与各个组的对接时间
 *	7. 虚位的测试方法：激光打向很远的一堵墙画十字，机械模式，掰头看一下回来之后反馈机械角度是否一致
 *	8. 调大符的流程：1、先确保弹道的稳定。
 *					 				2、画圆补偿（分析两边的问题）
 *					 				3、跟踪控制
 *  9. 敢想、实现。做到别人认为做不到的事情，做到极致
 *	10. 考虑实际的上场状态。将测试环境尽量做到与实战环境一致 
 *
 *	# 深大总冠军！ #
 *	# 步兵Infantry #
 */
 
/**
 *	@note
 *	底盘悬挂调试方法：
 *	拆分分析法 - 将摇杆拨至左上角，使得仅有两个轮子在旋转，观察车身偏转方向来调整悬挂
 *							将拨杆拨至右上角，使得仅有两个轮子在旋转，观察车身偏转方向来调整悬挂
 *
 *	沿地砖跑直线法 - 车侧身对准地砖的缝，摇杆跑直线，利用地面的直线来判断车身偏转方向来调整悬挂
 *
 *	平移法 - 
 *
 *	回来的时候一定要买根好一点的延长线，不然老是掉线！-_-\\
 */
 
/*
	2.1   	寒假回来上班
	2.15 	裁判系统测评
	3.2   	完整设计报告
	3.15 	确定操作手
	3.22 	完整形态视频
	3.25 	上述通过后，发放裁判系统
	4.初  	热身赛
	5.初  	分区赛
*/
 
/**
 *	-2020/01/30
 *	@task
 *	√(待测试)	1. CAN失联保护
 *	√(待测试)	2. CAN队列发送
 *	√(待测试)	3. 扭腰
 *	×(待定)		4. 底盘小陀螺就近归位
 */ 
 
/**
 *	-2020/02/02 + -2020/02/03 + -2020/02/04
 *	@task
 *	1. 思考击打策略，比如基地模式高射频低射速，加到控制代码框架上，以及键位安排
 *			- 加入自爆模式
 *			- 键位安排
 *	2. 爬坡
 */
 
/**
 *	-2020/02/05
 *	@task
 *	1. 单独写一个底盘的小陀螺代码，陀螺的速度变化公式参照单项赛步兵竞速与智能射击的说明，以供回来单项赛与自瞄调试用
 */

/**
 *	-2020/02/06 + -2020/02/07
 *	@task
 *	1. 提交一份完整的补弹对位报告，包括用什么传感器（数量）以及对位的逻辑等
 */
 
/**
 *	-2020/02/08 + -2020/02/09 + -2020/02/10
 *	@task
 *	1. 加上根据技能点改变射速和底盘功率代码框架
 *		- 弄懂功率计算方式以及功率控制的方法
 *		- 完成自动对位的控制代码
 *		- 移植宗信自瞄预测算法，加入开火判断
 *		- 跟进毓正步兵结构
 *		- 思考布线，以及对结构布线空间的要求
 */
 
/**
 *	-2020/02/11
 *	@task 
 *	1. RM论坛阅读“测试”，编写自动对位的测试方案
 *		- 环境搭建
 *			5面封闭，1面开放。
 *			
 *		- 代码测试
 *			1. 触发和退出
 *			2. y方向对位（1s完成）
 *			3. 大小补给站判断
 *			4. x方向对位（1.5s完成）
 *			5. xy方向同时对位，1.5s内完成
 *
 *	2. 今天一定要完成新自瞄算法的移植，思考逻辑，加入打弹判断
 *
 *	3. 打符的识别是视觉那边做的，所以射速调整的话就是这边发送射速给视觉，视觉调整预测量和抬头补偿
 *
 *	4. 自瞄的预测量是电控这边做的，所以射速调整需要改变预测量甚至打弹判断等等
 *
 *	5. 学习宗信做法，制作布线图
 *
 *	6. 构思各部分任务，利用git分支完成，带回来测试
 *
 *	7. 学习佳鸿，绘制硬件通讯图和任务逻辑设计
 *
 */
 
/**
 *	-2020/02/17
 *	1. 代码框架重构！
 */ 
 
/**
 *	@problem
 *	1. 键盘模式下，按Ctrl键，云台摆动回去的时候没有切换成机械模式；但遥控的切换就比较灵敏
 *	答：状态机代码存在bug：在sw2位于上的时候，会一直将gyro2mech_mode清零。正确做法是刚切换到键盘
 *		模式的时候清零。
 */
 
 int main(void)
{
 	All_Init();
	while(1) {
	}
}
