#include "init.h"
#include "scheduler.h"
 
/**
 *	-2019/11/17
 *	@note
 *	1. 摄像头的位置固定需要稳定，用大弹暴力测试
 *	2. 云台归中的意义是为了偏移的时候能够回来，保证能够看到大符
 *	3. 陀螺仪数据反馈会漂移，可以试一下换主控板（这个问题是陀螺仪初始化得到问题，已解决）
 *	4. 注意关大符，关电，关遥控等等细节问题
 *	5. 中二、热血，深大总冠军！
 *	6. 组长监督组员，分配好与各个组的对接时间
 *	7. 虚位的测试方法：激光打向很远的一堵墙画十字，机械模式，掰头看一下回来之后反馈机械角度是否一致
 *	8. 调大符的流程： 1、先确保弹道的稳定。
 *					 2、画圆补偿（分析两边的问题）
 *					 3、跟踪控制
 *  9. 敢想、实现。做到别人认为做不到的事情，做到极致
 *	10. 考虑实际的上场状态。将测试环境尽量做到与实战环境一致 
 *
 *	# 深大总冠军！ #
 *	# 步兵Infantry #
 */
 
/**
 *	@note
 *	底盘悬挂调试方法：
 *	拆分分析法 - 将摇杆拨至左上角，使得仅有两个轮子在旋转，观察车身偏转方向来调整悬挂
 *							将拨杆拨至右上角，使得仅有两个轮子在旋转，观察车身偏转方向来调整悬挂
 *
 *	沿地砖跑直线法 - 车侧身对准地砖的缝，摇杆跑直线，利用地面的直线来判断车身偏转方向来调整悬挂
 *
 *	平移法 - 
 *
 *	回来的时候一定要买根好一点的延长线，不然老是掉线！-_-\\
 */
 
/**
 *	-2019/01/30
 *	@task
 *	√(待测试)	1. CAN失联保护
 *	√(待测试) 2. CAN队列发送
 *	3. 扭腰
 *	4. 底盘小陀螺就近归位
 *	5. 自瞄的时候底盘45°正对敌方
 *	6. 
 *	7. 
 *	8. 自瞄
 */ 
 
 int main(void)
{

	All_Init();
	while(1) {
	}
}
