#include "init.h"
#include "scheduler.h"
 
/**
 *	-2019/11/17
 *	@note
 *	1. 摄像头的位置固定需要稳定，用大弹暴力测试
 *	2. 云台归中的意义是为了偏移的时候能够回来，保证能够看到大符
 *	3. 陀螺仪数据反馈会漂移，可以试一下换主控板（这个问题是陀螺仪初始化得到问题，已解决）
 *	4. 注意关大符，关电，关遥控等等细节问题
 *	5. 中二、热血，深大总冠军！
 *	6. 组长监督组员，分配好与各个组的对接时间
 *	7. 虚位的测试方法：激光打向很远的一堵墙画十字，机械模式，掰头看一下回来之后反馈机械角度是否一致
 *	8. 调大符的流程： 1、先确保弹道的稳定。
 *					 2、画圆补偿（分析两边的问题）
 *					 3、跟踪控制
 *  9. 敢想、实现。做到别人认为做不到的事情，做到极致
 *	10. 考虑实际的上场状态。将测试环境尽量做到与实战环境一致 
 *
 *	# 深大总冠军！ #
 *	# 步兵Infantry #q
 */
  
/**
 *	-2019/01/08
 *	@note
 *	这是考完试之后的第一天返工。只有对梦想无比执着的人，才会对冠军充满敬畏和野心。
 *	对自己的要求一低再低只会在战场上暴露出自己的软弱。
 *
 *	@task
 *	1. 整车的基本功能恢复(主控板的固定铜柱装上去之后再测试云台)
 *		基本功能：
 *		① 遥控，激光	√
 *		② 舵机				√
 *		③ 摩擦轮			√
 *		④ 拨盘				√
 *		⑤ 底盘				
 *		⑥ 云台
 *
 *	2. 小陀螺测试
 *		
 *	@problem
 *	1. 单独底盘的时候，底盘不能够根据遥控的期望输出。pid有计算，但是输出值感觉有些异常。
 *	2. 在图纸上量出打符的距离(7.5m)。
 *	3. 底盘不能正常控制，转不了。(排查之后发现是分电板，又被摆了一道)
 */
 
/**
 *	-2019/01/09
 *	@task
 *	√	1. 整车的基本功能恢复
 *		基本功能：
 *		① 底盘	√
 *		② 云台	√
 *			- 测试pitch的机械角度范围、中值
 *			- 测试yaw的机械角度范围、中值
 *			- 机械模式云台pid测试
 *			- 陀螺仪模式云台pid测试
 *
 *	√	2. 小陀螺测试
 *		
 *	@problem
 *	1. 底盘的电调容易在碰撞中重新初始化，线材连接处尽量打胶，这样可以减小这种情况的出现。
 *	
 */
 
/**
 *	-2019/01/10
 *	@task
 *	√	1. 小陀螺运动优化
 *	√	2. 焊接小电脑的线(串口3pin线，小电脑的供电线(这里先采用云台的那一路电分出来给小电脑用))
 *	√	3. 与视觉整合通信协议的代码
 *	√	4. 测试弹道
 *	√	5. 测试自瞄(粗略看效果，未打弹)
 *	√	6. 测试打符(粗略看效果，未打弹)
 *		
 *	@problem
 *	1. 底盘的电调容易在碰撞中重新初始化，线材连接处尽量打胶，这样可以减小这种情况的出现。
 *		-2020/01/10	出现次数：2
 *
 *	2. 感觉底盘的机械角度应该用累加角度值
 *			这里是自己的边界处理上出了问题。修改过来之后小陀螺就能够正常行进了(串级)，同时控制器也会自动选择就近回来
 *
 *	3. 底盘跑直线
 *			未测
 *	4. 
 */

/**
 *	-2019/01/11
 *	@task
 *	×	1. 小陀螺运动优化
 *	√	2. 与视觉测试通信命令码，视觉根据命令码切换执行函数
 *	√	3. 视觉那边写自启动代码
 *	×	4. 测试小符、大符的击打效果
 *	×	5. 自瞄效果复现，尝试增加加速度提高启动速度
 *		
 *	@problem
 *	1. 底盘的电调容易在碰撞中重新初始化，线材连接处尽量打胶，这样可以减小这种情况的出现。
 *		-2020/01/10	出现次数：2
 *
 *	2. 遥控数据出错导致程序启动保护
 *		-2020/01/11 出现次数：1
 *	
 *	3. 小陀螺云台转动的时候利用陀螺仪数据作补偿
 */
 
/**
 *	-2019/01/12
 *	@task
 *	×	1. 小陀螺运动优化
 *	×	2. 测试小符、大符的击打效果
 *	×	3. 自瞄效果复现，尝试增加加速度提高启动速度
 *	√	4. 小陀螺云台转动的时候利用陀螺仪数据作补偿
 *		
 *	@problem
 *	1. 底盘的电调容易在碰撞中重新初始化，线材连接处尽量打胶，这样可以减小这种情况的出现。
 *		-2020/01/10	出现次数：2
 *
 *	2. 遥控数据出错导致程序启动保护
 *		-2020/01/11 出现次数：1
 *	
 *	3. 小陀螺云台转动的时候利用陀螺仪数据作补偿
 */
 
/**
 *	-2019/01/16
 *	@task
 *	×	1. 小陀螺运动优化
 *	×	2. 测试小符、大符的击打效果
 *	×	3. 自瞄效果复现，尝试增加加速度提高启动速度
 *		
 *	@problem
 *	1. 底盘的电调容易在碰撞中重新初始化，线材连接处尽量打胶，这样可以减小这种情况的出现。
 *		-2020/01/10	出现次数：2
 *
 *	2. 遥控数据出错导致程序启动保护
 *		-2020/01/11 出现次数：1
 *	
 *	3. 小陀螺云台转动的时候利用陀螺仪数据作补偿
 *
 *	4. 键盘模式下底盘暴走
 *		-2020/01/17 出现次数：2
 *
 *	@note
 *	1. 平移的时候，可以先缓慢加速一段时间再将速度提上去。
 *
 */
 
/**
 *	-2019/01/16
 *	@task
 *	×	1. 小陀螺运动优化
 *	×	2. 测试小符、大符的击打效果
 *	×	3. 自瞄效果复现，尝试增加加速度提高启动速度
 *		
 *	@problem
 *	1. 底盘的电调容易在碰撞中重新初始化，线材连接处尽量打胶，这样可以减小这种情况的出现。
 *		-2020/01/10	出现次数：2
 *		-2020/01/17	出现次数：1
 *
 *	2. 遥控数据出错导致程序启动保护
 *		-2020/01/11 出现次数：1
 *	
 *	3. 键盘模式下底盘暴走
 *		-2020/01/16 出现次数：2
 *		-2020/01/17 出现次数：1
 *
 *	4. 遥控模式下底盘暴走
 *		-2020/01/17 出现次数：1
 *
 *	5. 右摩擦轮不转
 *
 *	@note
 *	1. 平移的时候，可以先缓慢加速一段时间再将速度提上去。
 */
 
 /**
  *	@problem
	*	底盘暴走原因分析：
	*	- 底盘CAN线读不到反馈，PID炸了
	*	- 检查代码逻辑，可能哪里溢出了
	*	- 遥控数据出错/失联，没做失联/出错保护
	*/
	
/**
 *	@note
 *	底盘悬挂调试方法：
 *	拆分分析法 - 将摇杆拨至左上角，使得仅有两个轮子在旋转，观察车身偏转方向来调整悬挂
 *							将拨杆拨至右上角，使得仅有两个轮子在旋转，观察车身偏转方向来调整悬挂
 *
 *	沿地砖跑直线法 - 车侧身对准地砖的缝，摇杆跑直线，利用地面的直线来判断车身偏转方向来调整悬挂
 *
 *	平移法 - 
 */
 
/**
 *	回来的时候一定要买根好一点的延长线，不然老是掉线！-_-\\
 *
 */
 
 int main(void)
{

	All_Init();
	while(1) {
	}
}
