/**
 * @file        ultra.c
 * @author      MaWeiming
 * @Version     V1.0
 * @date        21-January-2020
 * @brief       This file includes the Ultrasonic(超声波) external functions 
 * 							(based on ST Peripherals Libaray Keil.STM32F4xx_DFP.2.13.0)
 * @Version		
 */

/**
 *	# 超声波
 */

/* Includes ------------------------------------------------------------------*/
#include "ultra.h"

#include "usart3.h"
#include "delay.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
#define ULTRA_SPEED 0.34f	// mm/us

/* Private variables ---------------------------------------------------------*/
/* ## Global variables ## ----------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/* API functions -------------------------------------------------------------*/
/* #驱动层# ---------------------------------------------------------------------------------------------------------------------------------------*/
/**
 *	@brief	超声波读取数据
 *	@note		中断中调用
 */
uint16_t ULTRA_readData( uint8_t *rxBuf)
{
	uint16_t res;
	
	res = (((uint16_t)rxBuf[0]) << 8) | rxBuf[1];
	
	return res;
}

/**
 *	@brief	超声波探测命令
 */
void ULTRA_detect( uint8_t addr, uint8_t cmd)
{
	USART3_sendChar(addr);
	delay_us(100);
	USART3_sendChar(0x02);
	delay_us(100);
	USART3_sendChar(cmd);
}

/* #信息层# ---------------------------------------------------------------------------------------------------------------------------------------*/

/* #应用层# ---------------------------------------------------------------------------------------------------------------------------------------*/

/* #任务层# ---------------------------------------------------------------------------------------------------------------------------------------*/
/**
 *	@brief	超声波自动对位
 */
void ULTRA_control(void)
{
	ULTRA_detect(0xe8, 0x1e);
}
